<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
  <title>Kuzmin Vladimir Theory of graphs</title>


</head>
<body>

&#1058;&#1077;&#1086;&#769;&#1088;&#1080;&#1103; &#1075;&#1088;&#1072;&#769;&#1092;&#1086;&#1074; &mdash; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083; &#1076;&#1080;&#1089;&#1082;&#1088;&#1077;&#1090;&#1085;&#1086;&#1081; &#1084;&#1072;&#1090;&#1077;&#1084;&#1072;&#1090;&#1080;&#1082;&#1080;, &#1080;&#1079;&#1091;&#1095;&#1072;&#1102;&#1097;&#1080;&#1081;
&#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072; &#1075;&#1088;&#1072;&#1092;&#1086;&#1074;. &#1042; &#1086;&#1073;&#1097;&#1077;&#1084; &#1089;&#1084;&#1099;&#1089;&#1083;&#1077; &#1075;&#1088;&#1072;&#1092; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1082;&#1072;&#1082; &#1084;&#1085;&#1086;&#1078;&#1077;&#1089;&#1090;&#1074;&#1086;
&#1074;&#1077;&#1088;&#1096;&#1080;&#1085; (&#1091;&#1079;&#1083;&#1086;&#1074;), &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1105;&#1085;&#1085;&#1099;&#1093; &#1088;&#1105;&#1073;&#1088;&#1072;&#1084;&#1080;. &#1042; &#1089;&#1090;&#1088;&#1086;&#1075;&#1086;&#1084; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1080; &#1075;&#1088;&#1072;&#1092;&#1086;&#1084;
&#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1090;&#1072;&#1082;&#1072;&#1103; &#1087;&#1072;&#1088;&#1072; &#1084;&#1085;&#1086;&#1078;&#1077;&#1089;&#1090;&#1074; , &#1075;&#1076;&#1077; &#1077;&#1089;&#1090;&#1100; &#1087;&#1086;&#1076;&#1084;&#1085;&#1086;&#1078;&#1077;&#1089;&#1090;&#1074;&#1086; &#1083;&#1102;&#1073;&#1086;&#1075;&#1086; &#1089;&#1095;&#1105;&#1090;&#1085;&#1086;&#1075;&#1086;
&#1084;&#1085;&#1086;&#1078;&#1077;&#1089;&#1090;&#1074;&#1072;, &#1072; &mdash; &#1087;&#1086;&#1076;&#1084;&#1085;&#1086;&#1078;&#1077;&#1089;&#1090;&#1074;&#1086; .<br>

<img style="width: 719px; height: 447px;" alt="" src="file:///C:/Users/VladimirKuzmin/Desktop/Shot0.PNG"><br>
<br>
&#1057;&#1074;&#1103;&#1079;&#1085;&#1099;&#1081; &#1075;&#1088;&#1072;&#1092; &mdash; &#1075;&#1088;&#1072;&#1092;, &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1097;&#1080;&#1081; &#1088;&#1086;&#1074;&#1085;&#1086; &#1086;&#1076;&#1085;&#1091; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1091; &#1089;&#1074;&#1103;&#1079;&#1085;&#1086;&#1089;&#1090;&#1080;.
&#1069;&#1090;&#1086; &#1086;&#1079;&#1085;&#1072;&#1095;&#1072;&#1077;&#1090;, &#1095;&#1090;&#1086; &#1084;&#1077;&#1078;&#1076;&#1091; &#1083;&#1102;&#1073;&#1086;&#1081; &#1087;&#1072;&#1088;&#1086;&#1081; &#1074;&#1077;&#1088;&#1096;&#1080;&#1085; &#1101;&#1090;&#1086;&#1075;&#1086; &#1075;&#1088;&#1072;&#1092;&#1072; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1082;&#1072;&#1082;
&#1084;&#1080;&#1085;&#1080;&#1084;&#1091;&#1084; &#1086;&#1076;&#1080;&#1085; &#1087;&#1091;&#1090;&#1100;.<br>
<br>
<img style="width: 430px; height: 368px;" alt="" src="file:///C:/Users/VladimirKuzmin/Pictures/Shot2.PNG"><br>
<br>
&#1053;&#1077;&#1089;&#1074;&#1103;&#1079;&#1085;&#1099;&#1081; &#1075;&#1088;&#1072;&#1092; -- &#1075;&#1088;&#1072;&#1092;, &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1097;&#1080;&#1081; &#1073;&#1086;&#1083;&#1077;&#1077; &#1086;&#1076;&#1085;&#1086;&#1081; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1099; &#1089;&#1074;&#1103;&#1079;&#1085;&#1086;&#1089;&#1090;&#1080;<br>
<img style="width: 427px; height: 371px;" alt="" src="file:///C:/Users/VladimirKuzmin/Pictures/Shot3.PNG"><br>
<br>
&#1054;&#1088;&#1080;&#1077;&#1085;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1081; &#1075;&#1088;&#1072;&#1092; (&#1082;&#1088;&#1072;&#1090;&#1082;&#1086; &#1086;&#1088;&#1075;&#1088;&#1072;&#1092;) &mdash; (&#1084;&#1091;&#1083;&#1100;&#1090;&#1080;) &#1075;&#1088;&#1072;&#1092;, &#1088;&#1105;&#1073;&#1088;&#1072;&#1084;
&#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1075;&#1086; &#1087;&#1088;&#1080;&#1089;&#1074;&#1086;&#1077;&#1085;&#1086; &#1085;&#1072;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;. &#1053;&#1072;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1085;&#1099;&#1077; &#1088;&#1105;&#1073;&#1088;&#1072; &#1080;&#1084;&#1077;&#1085;&#1091;&#1102;&#1090;&#1089;&#1103; &#1090;&#1072;&#1082;&#1078;&#1077;
&#1076;&#1091;&#1075;&#1072;&#1084;&#1080;, &#1072; &#1074; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1080;&#1089;&#1090;&#1086;&#1095;&#1085;&#1080;&#1082;&#1072;&#1093; &#1080; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1088;&#1105;&#1073;&#1088;&#1072;&#1084;&#1080;.<br>
<img style="width: 465px; height: 376px;" alt="" src="file:///C:/Users/VladimirKuzmin/Pictures/Shot1.PNG"><br>
<br>
&#1043;&#1088;&#1072;&#1092;, &#1085;&#1080; &#1086;&#1076;&#1085;&#1086;&#1084;&#1091; &#1088;&#1077;&#1073;&#1088;&#1091; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1075;&#1086; &#1085;&#1077; &#1087;&#1088;&#1080;&#1089;&#1074;&#1086;&#1077;&#1085;&#1086; &#1085;&#1072;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;, &#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1085;&#1077;&#1086;&#1088;&#1080;&#1077;&#1085;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1084; &#1075;&#1088;&#1072;&#1092;&#1086;&#1084; &#1080;&#1083;&#1080; &#1085;&#1077;&#1086;&#1088;&#1075;&#1088;&#1072;&#1092;&#1086;&#1084;.<br>
<img style="width: 430px; height: 368px;" alt="" src="file:///C:/Users/VladimirKuzmin/Pictures/Shot2.PNG"><br>
<br>
&#1057;&#1090;&#1077;&#1087;&#1077;&#1085;&#1100; &#1080;&#1083;&#1080; &#1074;&#1072;&#1083;&#1077;&#1085;&#1090;&#1085;&#1086;&#1089;&#1090;&#1100; &#1074;&#1077;&#1088;&#1096;&#1080;&#1085;&#1099; &#1075;&#1088;&#1072;&#1092;&#1072; &mdash; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1088;&#1105;&#1073;&#1077;&#1088; &#1075;&#1088;&#1072;&#1092;&#1072; , &#1080;&#1085;&#1094;&#1080;&#1076;&#1077;&#1085;&#1090;&#1085;&#1099;&#1093; &#1074;&#1077;&#1088;&#1096;&#1080;&#1085;&#1077; .<br>
<img style="width: 427px; height: 363px;" alt="" src="file:///C:/Users/VladimirKuzmin/Pictures/Shot4.PNG"><br>
<br>
&#1044;&#1077;&#1088;&#1077;&#1074;&#1086; &mdash; &#1101;&#1090;&#1086; &#1089;&#1074;&#1103;&#1079;&#1085;&#1099;&#1081; &#1072;&#1094;&#1080;&#1082;&#1083;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1081; &#1075;&#1088;&#1072;&#1092;. &#1057;&#1074;&#1103;&#1079;&#1085;&#1086;&#1089;&#1090;&#1100; &#1086;&#1079;&#1085;&#1072;&#1095;&#1072;&#1077;&#1090;
&#1085;&#1072;&#1083;&#1080;&#1095;&#1080;&#1077; &#1087;&#1091;&#1090;&#1077;&#1081; &#1084;&#1077;&#1078;&#1076;&#1091; &#1083;&#1102;&#1073;&#1086;&#1081; &#1087;&#1072;&#1088;&#1086;&#1081; &#1074;&#1077;&#1088;&#1096;&#1080;&#1085;, &#1072;&#1094;&#1080;&#1082;&#1083;&#1080;&#1095;&#1085;&#1086;&#1089;&#1090;&#1100; &mdash; &#1086;&#1090;&#1089;&#1091;&#1090;&#1089;&#1090;&#1074;&#1080;&#1077;
&#1094;&#1080;&#1082;&#1083;&#1086;&#1074; &#1080; &#1090;&#1086;, &#1095;&#1090;&#1086; &#1084;&#1077;&#1078;&#1076;&#1091; &#1087;&#1072;&#1088;&#1072;&#1084;&#1080; &#1074;&#1077;&#1088;&#1096;&#1080;&#1085; &#1080;&#1084;&#1077;&#1077;&#1090;&#1089;&#1103; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1087;&#1086; &#1086;&#1076;&#1085;&#1086;&#1084;&#1091; &#1087;&#1091;&#1090;&#1080;.<br>
<img style="width: 400px; height: 343px;" alt="" src="file:///C:/Users/VladimirKuzmin/Pictures/Shot5.PNG"><br>
<br>
&#1069;&#1081;&#1083;&#1077;&#1088;&#1086;&#1074; &#1094;&#1080;&#1082;&#1083; &mdash; &#1101;&#1081;&#1083;&#1077;&#1088;&#1086;&#1074; &#1087;&#1091;&#1090;&#1100;, &#1103;&#1074;&#1083;&#1103;&#1102;&#1097;&#1080;&#1081;&#1089;&#1103; &#1094;&#1080;&#1082;&#1083;&#1086;&#1084;, &#1090;&#1086; &#1077;&#1089;&#1090;&#1100; &#1079;&#1072;&#1084;&#1082;&#1085;&#1091;&#1090;&#1099;&#1081;
&#1087;&#1091;&#1090;&#1100;, &#1087;&#1088;&#1086;&#1093;&#1086;&#1076;&#1103;&#1097;&#1080;&#1081; &#1095;&#1077;&#1088;&#1077;&#1079; &#1082;&#1072;&#1078;&#1076;&#1086;&#1077; &#1088;&#1077;&#1073;&#1088;&#1086; &#1075;&#1088;&#1072;&#1092;&#1072; &#1088;&#1086;&#1074;&#1085;&#1086; &#1087;&#1086; &#1086;&#1076;&#1085;&#1086;&#1084;&#1091; &#1088;&#1072;&#1079;&#1091;.<br>
<img style="width: 354px; height: 418px;" alt="" src="../Pictures/Shot6.PNG"><br>
<br>
&#1069;&#1081;&#1083;&#1077;&#1088;&#1086;&#1074;&#1072; &#1094;&#1077;&#1087;&#1100; &#1074; &#1075;&#1088;&#1072;&#1092;&#1077; &mdash; &#1101;&#1090;&#1086; &#1087;&#1091;&#1090;&#1100;, &#1087;&#1088;&#1086;&#1093;&#1086;&#1076;&#1103;&#1097;&#1080;&#1081; &#1087;&#1086; &#1074;&#1089;&#1077;&#1084; &#1088;&#1105;&#1073;&#1088;&#1072;&#1084; &#1075;&#1088;&#1072;&#1092;&#1072; &#1080; &#1087;&#1088;&#1080;&#1090;&#1086;&#1084; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1087;&#1086; &#1086;&#1076;&#1085;&#1086;&#1084;&#1091; &#1088;&#1072;&#1079;&#1091;.<br>
<br>
&#1055;&#1088;&#1086;&#1089;&#1090;&#1086;&#1081; &#1094;&#1080;&#1082;&#1083;, &#1087;&#1088;&#1086;&#1093;&#1086;&#1076;&#1103;&#1097;&#1080;&#1081; &#1095;&#1077;&#1088;&#1077;&#1079; &#1074;&#1089;&#1077; &#1074;&#1077;&#1088;&#1096;&#1080;&#1085;&#1099; &#1075;&#1088;&#1072;&#1092;&#1072;, &#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103;<br>
&#1075;&#1072;&#1084;&#1080;&#1083;&#1100;&#1090;&#1086;&#1085;&#1086;&#1074;&#1099;&#1084;<br>
<br>
<br>
<br>
<br>

</body>
</html>
